---
kind: type
id: T:Autodesk.Revit.DB.Structure.LoadCombinationState
source: html/e996d993-abe2-a1f8-a722-aedf6e95cf4a.htm
---
# Autodesk.Revit.DB.Structure.LoadCombinationState

Specifies load combination state.

## Syntax (C#)
```csharp
public enum LoadCombinationState
```